cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"

# sketchybar - used with aerospace
tap "FelixKratz/formulae"
brew 'sketchybar'
brew 'borders'

# granted - multi account aws helper
tap "common-fate/granted"
brew 'granted'

# packer - fucking hashi
tap "hashicorp/tap"
brew "hashicorp/tap/packer"

# Brews
brew 'bash'
brew 'wget'
brew 'yadm'
brew 'git'
brew 'starship'
brew 'podman'
brew 'podman-compose'
brew 'clipboard'
brew 'zoxide'
brew 'awscli'
brew 'jq'
brew 'watch'
brew 'cfn-lint'
brew 'sshpass'
brew 'jfrog-cli'
brew 'thefuck'
brew 'yamllint'
brew 'opentofu'
brew 'terraform'
brew 'glab'
brew 'yq'
brew 'tree'

# Brews -> Neovim
brew 'neovim'
brew 'ripgrep'
brew 'lazygit'
brew 'rustup'
brew 'php'
brew 'composer'
brew 'fd'
brew 'ruby'
brew 'openjdk'
brew 'julia'
brew 'fzf'
brew 'luarocks'
brew 'perl'
brew 'cpanminus'
brew 'go'
brew 'rust'
brew 'shellcheck'
brew 'mkdocs'
brew 'imagemagick'
brew 'ghostscript'

# Brews -> python3
brew 'python3'
brew 'pipx'
brew 'pyright'

# Casks
cask 'slack'
cask 'syncthing'
cask 'enpass'
cask 'obsidian'
cask 'vivaldi'
cask 'visual-studio-code'
cask 'bitwarden'
cask 'gimp'
cask 'openvpn-connect'
cask 'font-hack-nerd-font'
cask 'wine-stable'                # Emulate windows apps
cask 'trunk-io'                   # Code Quality tool
cask 'nikitabobko/tap/aerospace'  # Tiling window manager like i3
cask 'postman'                    # API Tool
cask 'raycast'                    # Extendable Launcher
cask 'drawio'                     # Diagramming tool
cask 'session-manager-plugin'     # AWS CLI session manager plugin
cask 'th-ch/youtube-music/youtube-music' # Youtube Music
cask 'cursor'                     # cursor AI IDE
cask 'wireshark'
cask 'darktable'
cask 'devpod'                     # https://devpod.sh
cask 'kitty'                      # terminal emulator
