cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# Brews
brew 'zellij'
brew 'git'
brew 'starship'
brew 'podman'
brew 'clipboard'

# Brews -> Neovim
brew 'neovim'
brew 'ripgrep'
brew 'lazygit'
brew 'rustup'
brew 'php'
brew 'composer'
brew 'fd'
brew 'ruby'
brew 'openjdk'
brew 'julia'
brew 'python3'

# Casks
cask 'wezterm'
cask 'slack'
cask 'syncthing'
cask 'enpass'
cask 'obsidian'
cask 'vivaldi'
cask 'font-hack-nerd-font'
