cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"

# sketchybar - used with aerospace
tap "FelixKratz/formulae"
brew 'sketchybar'
brew 'borders'

# granted - multi account aws helper
tap "common-fate/granted"
brew 'granted'

# packer - fucking hashi
tap "hashicorp/tap"
brew "hashicorp/tap/packer"

# Brews
brew 'postgresql@13'
brew 'libpq'
brew 'bash'
brew 'wget'
brew 'yadm'
brew 'git'
brew 'podman'
brew 'podman-compose'
brew 'clipboard'
brew 'zoxide'
brew 'awscli'
brew 'jq'
brew 'watch'
brew 'cfn-lint'
brew 'sshpass'
brew 'jfrog-cli'
brew 'thefuck'
brew 'yamllint'
brew 'opentofu'
brew 'terraform'
brew 'terragrunt'
brew 'tflint'
brew 'terraform-docs'
brew 'glab'
brew 'yq'
brew 'tree'
brew 'nmap'
brew 'curl'
brew 'graphviz'
brew 'pre-commit'
brew 'commitizen'
brew 'commitlint'
brew 'gitlint'
brew 'gitleaks'

# Brews -> k8s
brew 'kubernetes-cli'
brew 'k9s'

# Brews -> shell
brew 'zsh'
brew 'starship'
brew 'fzf'
brew 'fish'

# Brews -> Neovim
brew 'neovim'
brew 'ripgrep'
brew 'lazygit'
brew 'rustup'
brew 'php'
brew 'composer'
brew 'fd'
brew 'ruby'
brew 'openjdk'
brew 'julia'
brew 'luarocks'
brew 'perl'
brew 'cpanminus'
brew 'go'
brew 'shellcheck'
brew 'mkdocs'
brew 'imagemagick'
brew 'ghostscript'
brew 'tectonic'
brew 'pngpaste'
brew 'tree-sitter'
brew 'prettier'

# Mermaid CLI for Snacks image diagrams
brew 'node'

# Brews -> python3
brew 'python3'
brew 'pipx'
brew 'pyright'
brew 'pyenv'

# Casks
cask 'slack'
cask 'syncthing-app'
cask 'enpass'
cask 'obsidian'
cask 'vivaldi'
cask 'visual-studio-code'
cask 'bitwarden'
cask 'gimp'
cask 'openvpn-connect'
cask 'font-hack-nerd-font'
cask 'wine-stable'                # Emulate windows apps
cask 'trunk-io'                   # Code Quality tool
cask 'nikitabobko/tap/aerospace'  # Tiling window manager like i3
cask 'postman'                    # API Tool
cask 'raycast'                    # Extendable Launcher
cask 'drawio'                     # Diagramming tool
cask 'session-manager-plugin'     # AWS CLI session manager plugin
cask 'th-ch/youtube-music/youtube-music' # Youtube Music
cask 'cursor'                     # cursor AI IDE
cask 'cursor-cli'
cask 'wireshark-app'
cask 'darktable'
cask 'devpod'                     # https://devpod.sh
cask 'wezterm'                    # terminal emulator
cask 'powershell'
cask 'bruno'                      # Postman alternative
cask 'betterdisplay'              # Display Enhancer for Mac
